{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and a public inquiry form with admin retrieval.",
  "feature_evidence.json": "Feature evidence report describing removed IMC sections, navigation updates, and cleanup tasks with associated files.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend components and sections for the marketing site.",
  "frontend/index.css": "Tailwind CSS base configuration defining light/dark theme tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component composing the site header, sections, footer, and toaster.",
  "frontend/src/components/InquiryForm.tsx": "Inquiry form component with validation, submission logic, and success state UI.",
  "frontend/src/components/sections/B2BSection.tsx": "Marketing section for B2B partners showing benefits, core pillars, and a contact CTA with icons and styled cards.",
  "frontend/src/components/sections/BrandStorySection.tsx": "Presents the brand story with three themed cards about nature, craftsmanship, and global impact.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays a contact form section with introductory text and an InquiryForm component.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, brand tagline, description, and buttons scrolling to contact or products.",
  "frontend/src/components/sections/ImcObjectivesSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/sections/ImcPlanSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/sections/ProductsSection.tsx": "Showcases product features, an image, and a card highlighting use cases for sustainable jute bags.",
  "frontend/src/components/sections/SustainabilitySection.tsx": "Highlights sustainability pillars and compliance details using cards and icons.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand text, quick navigation links, social icons, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop navigation, and mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, state management, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines a submit inquiry mutation that calls the backend actor and invalidates inquiry queries on success.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH-based light/dark theme variables plus global styles and a jute-texture background.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom themes, OKLCH color mapping, fonts, animations, plugins, and container settings.",
  "project_state.json": "Captures project metadata, goals, architectural notes, and existing feature definitions for the Vanaprana website."
}